Can't form Angular Dimension.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AngularDimensionRegenFailed { get; }
  Visual Basic
Public Shared ReadOnly Property AngularDimensionRegenFailed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AngularDimensionRegenFailed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace